In [1]:
import pandas as pd

In [4]:
dados = {'emprego': ['Administrador_banco_dados', 'Programador', 'Arquiteto de redes'],
                    'nova_jersey': [97350, 82080, 112840],
                    'florida': [77140, 71540, 62310]}

In [6]:
type(dados)

dict

In [14]:
df = pd.DataFrame(dados)

In [15]:
df

                     emprego  nova_jersey  florida
0  Administrador_banco_dados        97350    77140
1                Programador        82080    71540
2         Arquiteto de redes       112840    62310

In [16]:
df

                     emprego  nova_jersey  florida
0  Administrador_banco_dados        97350    77140
1                Programador        82080    71540
2         Arquiteto de redes       112840    62310

In [17]:
df['nova_jersey'].sum()

292270

In [18]:
df['florida'].sum()

210990

In [19]:
df['%_nova_jersey'] = df['nova_jersey'] / df['nova_jersey'].sum() * 100

In [21]:
df['%_florida'] = df['florida'] / df['florida'].sum() * 100

In [22]:
df

                     emprego  nova_jersey  florida  %_nova_jersey  %_florida
0  Administrador_banco_dados        97350    77140      33.308242  36.560974
1                Programador        82080    71540      28.083621  33.906820
2         Arquiteto de redes       112840    62310      38.608136  29.532205